linux/arch/arch_install.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>arch_install</title>
<!-- 2016-12-04 Sun 22:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">arch_install</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. arch linux install</a>
<ul>
<li><a href="#sec-1-1">1.1. system install</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. download iso</a></li>
<li><a href="#sec-1-1-2">1.1.2. install arch system</a></li>
<li><a href="#sec-1-1-3">1.1.3. install arch desktop</a></li>
<li><a href="#sec-1-1-4">1.1.4. install arch to usb</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> arch linux install</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> system install</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> download iso</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">

<pre class="src src-bash">wget http://mirror.lzu.edu.cn/archlinux/iso/2016.10.01/archlinux-2016.10.01-dual.iso
md5sum archlinux-2016.10.01-dual.iso  #  make sure md5sum is true
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> install arch system</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
running in iso  # get a shell
</p>
<div class="org-src-container">

<pre class="src src-shell">loadkeys us  # set key layout
ping -c 2 qq.com # make sure connect to internet
timedatectl set-ntp true  # update system time
lsblk /dev/sda  # view disk part
fdisk /dev/sda  # part install disk
  --&gt; n \n p \n \n +512M \n \n
  --&gt; n \n p \n \n \n w
fdisk -l  #  tow part disk
# sda      8:0    0    20G  0 disk
# ├─sda1   8:1    0   512M  0 part
# ├─sda2   8:2    0  15.5G  0 part
mkfs.fat /dev/sda1   # fomat part to fat32(boot)
mkfs.ext4 /dev/sda2  # fomat part to ext4(root)
mount /dev/sda2 /mnt  # / part
mkdir -p /mnt/boot   # make boot dir
mount /dev/sda1 /mnt/boot  # sda1 is boot part
sed -i '/Score/{/China/!{n;s/^/#/}}' /etc/pacman.d/mirrorlist  # command other score url
pacstrap /mnt base base-devel net-tools  # start install system to disk
genfstab -U /mnt &gt;&gt; /mnt/etc/fstab  # add mount table
arch_chroot /mnt  # change root directory to install disk
echo flytrap &gt; /etc/hostname  # set hostname
passwd  # input the same password to stdin, set root password
pacman -S zsh  # install zsh
chsh -s /bin/zsh  # change default shell to zsh
systemctl enable dhcpcd  # the boot is start dhcp
pacman -S grub  # install grub
grub-install --boot-directory=/boot /dev/sda  # install grub to disk
grub-mkconfig -o /boot/grub/grub.cfg  # retouch grub config file
exit  # exit cur shell
reboot
</pre>
</div>
<p>
system install ok!!!
Use root user login to system.
</p>
<div class="org-src-container">

<pre class="src src-shell">echo $SHELL  # /bin/zsh
# hwclock --systohc --utc
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> install arch desktop</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
i3 install ok!!!
</p>
<div class="org-src-container">

<pre class="src src-shell">pacman -S xorg-server xorg-xinit # install xorg server and xinit
pacman -S i3  # install i3 desktop system
pacman -S xf86-video-vesa  # device open sorce
cd /etc/X11/xinit/  # change xinit setting
# command last five line and add two line:
i3-wm &amp;
exec i3
startx
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> install arch to usb</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
install arch to usb
</p>

<div class="org-src-container">

<pre class="src src-shell">mount ~/soft/iso/archlinux-2016.10.01-dual.iso /mnt/iso/  # mount iso to disk
unsquashfs -d /tmp/arch ./x86_64/airootfs.sfs  # system install env ready
fdisk /dev/sdc  # part disk
fdisk /dev/sdc  # part install disk
  --&gt; n \n p \n \n +256M \n \n
  --&gt; n \n p \n \n \n w
lsblk /dev/sdc  #  tow part disk
# sdc      8:32   1  7.4G  0 disk
# ├─sdc1   8:33   1  256M  0 part
# └─sdc2   8:34   1  7.1G  0 part
cd /tmp/arch  # change pwd to arch env
cp /etc/resolv.conf etc/
mount --rbind /proc/ proc/
mount --rbind /sys/ sys/
mount --rbind /dev/ dev/
mount --rbind /run/ run/
chroot .  # change path
mkfs.fat /dev/sdc1
mkfs.ext4 /dev/sdc2
mount /dev/sdc2 /mnt/usb/
mkdir -p /mnt/usb/boot/efi
mount /dev/sdc1 /mnt/usb/
mount /dev/sdc1 /mnt/usb/boot/efi/
mount --rbind /mnt mnt/
sed -i '/Score/{/China/!{n;s/^/#/}}' /etc/pacman.d/mirrorlist
pacstrap /mnt base base-devel net-tools
...
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-12-04 Sun 22:20</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
